RuanJG/stm32App/source/app/app_CSWL_Control_Board_V2.c
	console_init( CONSOLE_UART_TYPE ,CONSOLE_UART , NULL, 0);
	//console_init( CONSOLE_USB_TYPE ,NULL );
	
}






#define RELAY_OUTPUT_TO_SHAVE(X) GPIO_WriteBit( GPIOC, GPIO_Pin_6 ,0); GPIO_WriteBit( GPIOC, GPIO_Pin_5 ,X)
#define RELAY_OUTPUT_TO_METER(X) GPIO_WriteBit( GPIOA, GPIO_Pin_7 ,0); GPIO_WriteBit( GPIOA, GPIO_Pin_6 ,X)
#define RELAY_OUTPUT_TO_RESISTOR(X) GPIO_WriteBit( GPIOA, GPIO_Pin_5 ,0); GPIO_WriteBit( GPIOA, GPIO_Pin_4 ,X)
#define RELAY_VDD_TO_METER(X) if( X==1 ){GPIO_WriteBit( GPIOA, GPIO_Pin_7 ,0); GPIO_WriteBit( GPIOA, GPIO_Pin_6 ,0);}
#define RELAY_POWER_TO_CSWL(X) GPIO_WriteBit( GPIOB, GPIO_Pin_2 ,0); GPIO_WriteBit( GPIOB, GPIO_Pin_1 ,X)


#define SIGNAL_TO_AIRPRESS(X) GPIO_WriteBit( GPIOC, GPIO_Pin_8 ,0); GPIO_WriteBit( GPIOC, GPIO_Pin_4 ,X)

#define INDEX_SHAVE  0x1
#define INDEX_RESISTOR 0x2
#define INDEX_OUTPUT_METER 0x8
#define INDEX_VDD_METER 0x4
#define INDEX_POWER  0x10
#define INDEX_SIGNAL 0x20

volatile unsigned char relay_status;

void relay_update_status( unsigned char status )
{

	SIGNAL_TO_AIRPRESS( ((INDEX_SIGNAL & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_SHAVE( ((INDEX_SHAVE & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_METER( ((INDEX_OUTPUT_METER & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_RESISTOR( ((INDEX_RESISTOR & status)==0 ? 0: 1) );
	RELAY_VDD_TO_METER( ((INDEX_VDD_METER & status)==0 ? 0: 1) );
	RELAY_POWER_TO_CSWL( ((INDEX_POWER & status)==0 ? 0: 1) );
	relay_status = status;
}

void relay_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5| GPIO_Pin_6| GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	relay_update_status(0);


}





#define SW_INTERVAL_COUNT  20  // SW_INTERVAL_MS 检查一次GPIO口， SW_INTERVAL_COUNT次后发出按键事件, 用作过滤
#define SW_INTERVAL_TOLERANCE 7 // 50%
#define SW_INTERVAL_MS 5
systick_time_t sw_timer;
volatile struct switcher startButton;
//volatile unsigned char startButton_triggered =0 ;

void switch_key_press_handler()
{
	unsigned char data = 1;
	PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_BUTTON , (unsigned char*)&data, 1 );
}

void switch_init()
{
	switcher_init( &startButton, SW_INTERVAL_COUNT ,SW_INTERVAL_TOLERANCE , 1 , 0 , GPIOA, GPIO_Pin_0, GPIO_Mode_IN_FLOATING, switch_key_press_handler , NULL);
  
	systick_init_timer( &sw_timer, SW_INTERVAL_MS );
}

void switch_even()
{
	if( 0 == systick_check_timer( &sw_timer ) ) return;
	
	switcher_interval_check( &startButton );

}





Uart_t *uart_pressure_dev = NULL;
volatile int uart_pressure_test_en = 0;
volatile int uart_pressure_round = 0; // 1000,000 times send result
void uart_pressure_test_loop()
{
	volatile int i,ms;
	unsigned char buffer[64];
	unsigned char data[4] = {0x5A,0x55,0xAA,0xA5};
	unsigned char val;
	
	if( uart_pressure_dev == NULL ) return;
	
	for( i=0; i< sizeof(buffer); i++ ) buffer[i] = data[i%4];
	
	Uart_Clear_Rx(uart_pressure_dev);
	
	Uart_Put(uart_pressure_dev,buffer,sizeof(buffer));
	
	ms=0;
	for( i=0; i< sizeof(buffer); i++ )
	{
		while(1)
		{
			if( 1 == Uart_Get(uart_pressure_dev, &val,1) )
			{
				ms = 0;
				if( val != buffer[i] ){
					_LOGE("Uart test Failed\n");
					systick_delay_ms(10);
					uart_pressure_test_en =0;
					return;
				}
				break;
			}else{
				if( ms > 50 ){
					_LOGE("Time Out\n");
					systick_delay_ms(10);
					uart_pressure_test_en =0;
					return;
				}else{
					systick_delay_ms(1);
					ms++;
				}
			}
		}
	}

	uart_pressure_round += sizeof(buffer);
	if( uart_pressure_round >= 1000000 ) {
		uart_pressure_round = 0;
		_LOGW("Test 1000000 bytes OK\n");
	}
}


volatile int Ameter_en_cnt;
volatile float Ameter_val;
volatile int  Ameter_val_count;

void Ameter_init()
{
	miniMeter_init( &Ameter ,AMETER_UART , 0x00);
	Ameter_en_cnt = 0;
	Ameter_val_count = 0;
}

int Ameter_start( int cnt )
{
	Ameter_en_cnt = cnt;
	
	if( Ameter_en_cnt == 0 ){
		miniMeter_stop(&Ameter);
		return 1;
	}else{
		if( 1 == miniMeter_start(&Ameter) ){
			Ameter_val_count = 0;
			Ameter_val = 0;
			return 1;
		}else{
			Ameter_en_cnt = 0;
			return 0;
		}
	}
}

void Ameter_even()
{
	float value;
	unsigned char data[4];
	
	if( Ameter_en_cnt == 0 ) return;
	
	if( 1== miniMeter_check( &Ameter, &value) ){
		Ameter_val_count++;
		Ameter_val += value;
		if( Ameter_val_count >= Ameter_en_cnt ){
			Ameter_val /= Ameter_val_count;
			memcpy( data, (unsigned char*) &Ameter_val , 4 );
			if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_AMETER, data , sizeof(data) ) ){
				PC_LOGE("Ameter_even: send data to PC error");
			}
			Ameter_val_count = 0;
			Ameter_val = 0;
		}
	}
}


/*
volatile int Vmeter_en_cnt;
volatile float Vmeter_val;
volatile int  Vmeter_val_count;

void Vmeter_init()
{
	miniMeter_init( &Vmeter ,VMETER_UART , 0x00);
	Vmeter_en_cnt = 0;
	Vmeter_val_count = 0;
}

int Vmeter_start( int cnt )
{
	Vmeter_en_cnt = cnt;
	
	if( Vmeter_en_cnt == 0 ){
		miniMeter_stop(&Vmeter);
		return 1;
	}else{
		if( 1 == miniMeter_start(&Vmeter) ){
			Vmeter_val_count = 0;
			Vmeter_val = 0;
			return 1;
		}else{
			Vmeter_en_cnt = 0;
			return 0;
		}
	}
}

void Vmeter_even()
{
	float value;
	unsigned char data[4];
	
	if( Vmeter_en_cnt == 0 ) return;
	
	if( 1== miniMeter_check( &Vmeter, &value) ){
		Vmeter_val_count++;
		Vmeter_val += value;
		if( Vmeter_val_count >= Vmeter_en_cnt ){
			Vmeter_val /= Vmeter_val_count;
			memcpy( data, (unsigned char*) &Vmeter_val , 4 );
			if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
				PC_LOGE("Vmeter_even: send data to PC error");
			}
			Vmeter_val_count = 0;
			Vmeter_val = 0;
		}
	}
}
*/



