RuanJG/stm32App/source/app/app_CSWL_Control_Board_V2.c
#if USING_VICTOR8165_AS_VMETER

#define VICTOR8165_BUFFSIZE 31

Uart_t *victor8165_uart;
volatile int victor8165_step;
volatile int victor8165_received_result;
volatile int victor8165_buffer_index;
volatile int victor8165_updated;
volatile float victor8165_value;
volatile int victor8165_en;
char victor8165_buffer[VICTOR8165_BUFFSIZE+1];
systick_time_t victor8165_timer;



void victor8165_send_cmd( char* cmd)
{
	Uart_Put( victor8165_uart, (unsigned char *)cmd,  strlen(cmd) );
}

int victor8165_check( float *value)
{
	if( victor8165_updated == 1 ){
		*value = victor8165_value;
		victor8165_updated = 0;
		return 1;
	}
	return 0;
}

void victor8165_start()
{
	victor8165_step = 0;
	victor8165_buffer_index = 0;
	victor8165_received_result = 0;
	victor8165_updated= 0;
	victor8165_en =1;
}

void victor8165_stop()
{
	victor8165_updated= 0;
	victor8165_en =0;
}

void victor8165_init( Uart_t *uart )
{
	victor8165_uart = uart;
	victor8165_step = 0;
	victor8165_buffer_index = 0;
	victor8165_received_result = 0;
	victor8165_updated= 0;
	victor8165_en = 0;
}

void victor8165_even()
{
	int i,len;
	unsigned char data[4];
	
	for( i=0; i< VICTOR8165_BUFFSIZE; i++ ){
		if( 1== Uart_Get( victor8165_uart, (victor8165_buffer + victor8165_buffer_index) , 1) ){
			if( victor8165_buffer[victor8165_buffer_index] == 0x0A ){
				victor8165_received_result = victor8165_buffer_index+1;
				victor8165_buffer[victor8165_received_result] = 0; // set string end tag
				victor8165_buffer_index = 0;
				break;
			}else{
				victor8165_buffer_index ++;
				if( victor8165_buffer_index >= VICTOR8165_BUFFSIZE ) victor8165_buffer_index = 0;
			}
		}else{
			break;
		}
	}
	
	if( victor8165_en == 0 ) return; 
	
	switch (victor8165_step)
	{
		case 0: victor8165_send_cmd("VDC\n"); victor8165_step++; systick_init_timer(&victor8165_timer, 200); break;
		case 1: if(systick_check_timer(&victor8165_timer)){victor8165_send_cmd("RATE M\n");victor8165_step++;}break;
		case 2: if(systick_check_timer(&victor8165_timer)){victor8165_send_cmd("RANGE 3\n");victor8165_step++;}break;
		case 3: if(systick_check_timer(&victor8165_timer)){victor8165_send_cmd("FUNC1?\n");victor8165_step++;systick_init_timer(&victor8165_timer, 300);}break;
		case 4: 
				if( victor8165_received_result > 0 )
				{
						if( victor8165_received_result == strlen("VDC\n") && 0 == strncmp("VDC\n",(char*)victor8165_buffer , victor8165_received_result) ){
							victor8165_step++; 
						}else{
							victor8165_step = 0;
						}
						victor8165_received_result=0;
				}else{ 
				     if(systick_check_timer(&victor8165_timer)){
							 victor8165_step = 0;
							 PC_LOGE("victor8165_even: Init timeout");
						 }  
				}; 
	  break;	
		case 5: systick_init_timer(&victor8165_timer, 200);victor8165_send_cmd("MEAS1?\n");victor8165_step++;break;
		case 6:
			if( victor8165_received_result > 2 ){
				sscanf((const char*)victor8165_buffer , "%e;\n",  &victor8165_value);
				victor8165_updated = 1;
				memcpy( data, (unsigned char*) &victor8165_value , 4 );
				if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
					PC_LOGE("victor8165_even: send data to PC error");
				}
				victor8165_received_result = 0;
				//no delay
				//victor8165_send_cmd("MEAS1?\n");
			}else{
				if(systick_check_timer(&victor8165_timer)){
					if( victor8165_updated == 0) PC_LOGE("victor8165_even: MEAS1 cmd timeout");
					//delay 
					victor8165_updated = 0;
					victor8165_send_cmd("MEAS1?\n");
				}
			}
		break;
			
		default:
			PC_LOGE("victor8165_even: Something error!");
		break;
		
	}
}

#endif




#if USING_TONGHUI_TH963_VMETER

// cmd 'MEAS:VOLT:DC? 100\n' -> '2.45693330E-04\r\n'  or  '-2.45693330E-04\r\n' 

//or 
	
// cmd 'conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 3\n' ,  'read?;*trg' or 'init;fetc?;*trg\n'
// cmd 'abort'

systick_time_t th963_timer;

typedef struct TH963_Meter {
	Uart_t *uart;
	volatile float measureVal;
	volatile unsigned char updated;
	volatile unsigned char started;
	char cmd[32];
	char cmdRes[32];
	volatile int cmdStep;
	volatile int initStep;
	char buffer[32];
	volatile int bufferIndex;
}TH963_Meter_t;


TH963_Meter_t Vmeter_th963;


void TH963_cmd_reset(TH963_Meter_t * th963)
{
	th963->bufferIndex = 0;
	th963->cmd[0]=0;
	th963->cmdRes[0] =0;
	th963->cmdStep = 0;
}

void TH963_clear(TH963_Meter_t * th963)
{
	th963->started = 0;
	th963->updated = 0;
	th963->initStep = 0;
	TH963_cmd_reset( th963 );
	Uart_Clear_Rx( th963->uart );
}

int TH963_try_read_one_msg( TH963_Meter_t * th963 )
{
	volatile unsigned char data;
	
	while(1)
	{
		if( 1 == Uart_Get( th963->uart, &data ,1 ))
		{
			if( th963->bufferIndex >= (sizeof( th963->buffer ) -2) )
			{
				th963->bufferIndex = 0;
				PC_LOGE("TH963_try_read_one_msg: overflow!");
			}
			th963->buffer[ th963->bufferIndex++ ] = data;
			if( data == '\n' )
			{
				th963->buffer[ th963->bufferIndex++ ] = 0;
				th963->bufferIndex = 0;
				return 1;
			}
		}else{
			return 0;
		}
	}
}	

int TH963_cmd_even(TH963_Meter_t * th963, char * cmd , int timeoutMs , int waitResult)
{
	int cnt;
	volatile unsigned char data;
	
	switch( th963->cmdStep )
	{
		case -1:
			//error
		break;
		
		case 0:  // send cmd
			TH963_cmd_reset( th963 );
			Uart_Put(th963->uart, (unsigned char*) cmd, strlen(cmd));
			th963->cmdStep++;
			systick_init_timer( &th963_timer, timeoutMs);
		break;
		
		case 1: // verify cmd 
			
			if( waitResult == 1 ){
				// if has result , no  wait for cmd error msg
				th963->cmdStep++;
				break;
			}
			
			if( 1 == TH963_try_read_one_msg( th963 ) )
			{
				PC_LOGE("TH963_cmd_even: error>%s",th963->buffer);
				th963->cmdStep = -1;
			}
		
			#if 0  //echo verify cmd
			if( 1 == TH963_try_read_one_msg( th963 ) )
			{
				if( 0 == strcmp( th963->buffer , cmd ) )
				{
					//th963->bufferIndex = 0;
					th963->cmdStep++;
					systick_init_timer( &th963_timer, timeoutMs);
				}
			}
			if( 1 == systick_check_timer( &th963_timer ) ){
				PC_LOGE("TH963_cmd_even: verify cmd timeout !");
				th963->cmdStep = -1;
			}
			#endif 
			
			if( 1 == systick_check_timer( &th963_timer ) ){
				th963->cmdStep++;
			}

		break;
			
		case 2: //get result
			if( waitResult == 0 ){
				th963->cmdStep++;
				break;
			}
				
			if( 1 == TH963_try_read_one_msg( th963 ) )
			{
				strcpy( th963->cmdRes , th963->buffer);
				th963->cmdStep++;
			}
			if( 1 == systick_check_timer( &th963_timer ) ){
				PC_LOGE("TH963_cmd_even: verify cmd timeout !");
				th963->cmdStep = -1;
			}
				
		break;
			
		case 3:
			// finish
		break;
		
		default:
			
		break;
	}
	
