RuanJG/stm32App/source/app/app_CSWL_Control_Board_V2.c
	if( th963->cmdStep == -1 ) return -1;
	if( th963->cmdStep == 3 ) return 1;
	
	return 0;
}


int TH963_init(TH963_Meter_t * th963, Uart_t *uart_p )
{
	th963->uart = uart_p;
	TH963_clear(th963);
	return 0;
}

int TH963_start( TH963_Meter_t * th963 , int en )
{
	if( th963->started == 0 && en ==1 ){
		TH963_clear( th963 );
	}
	th963->started = en;
	
	if( th963->started == 0 ) PC_LOGI("TH963 Vmeter stop\n");
	if( th963->started == 1 ) PC_LOGI("TH963 Vmeter start\n");
	
	return 1;
}


void TH963_even(TH963_Meter_t * th963)
{
	int value;
	unsigned char data[4];
	
	if( th963->started != 1 ) return;

	// currently I just use measure cmd
	th963->initStep = 2; 
	
	switch( th963->initStep )
	{
		case 0:
			value = TH963_cmd_even( th963, "conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 1\n", 300, 0);
		  if( value == 1 ){
				th963->initStep++;
			}
			if( value == -1 ){
				TH963_cmd_reset(th963);
			}
		break;
			
		case 1:
			value = TH963_cmd_even( th963, "init;read;trig\n", 300, 1);
		  if( value == 1 ){
				sscanf((const char*)th963->buffer , "%e\n",  &th963->measureVal);
				th963->updated = 1;
				memcpy( data, (unsigned char*) &th963->measureVal , 4 );
				if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
					PC_LOGE("TH963_even: send data to PC error");
				}
			}
			if( value == -1 ){
				TH963_cmd_reset(th963);
			}
		break;
			
		case 2:
			value = TH963_cmd_even( th963, "MEAS:VOLT:DC? 100\n", 300, 1 );
		  if( value == 1 ){
				sscanf((const char*)th963->buffer , "%e\n",  &th963->measureVal);
				th963->updated = 1;
				memcpy( data, (unsigned char*) &th963->measureVal , 4 );
				if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
					PC_LOGE("TH963_even: send data to PC error");
				}
			}
			if( value == -1 ){
				TH963_cmd_reset(th963);
			}
		break;
			
		default:
			
		break;
	}
	
}


int TH963_cmd_sync(TH963_Meter_t * th963, char * cmd , int delayMs, int has_result , int retryTimes)
{
	volatile int val;
	int i;
	
	for( i=0; i< retryTimes; i++)
	{
		while( 1 ){
			val = TH963_cmd_even( th963, cmd , delayMs, has_result ) ;
			if( val  != 0 ) break;
		}
		if( val == 1 ){
			break;
		}
	}
	
	if( val == 1 ) return 1;
	return 0;
}

float TH963_measure( TH963_Meter_t * th963 )
{
	if( 1 == TH963_cmd_sync(th963, "MEAS:VOLT:DC? 100\n" , 500, 1 , 3) ){
		sscanf((const char*)th963->buffer , "%e\r\n",  &th963->measureVal);
		return th963->measureVal;
	}else{
		return 0;
	}
}

#endif















void cmd_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = Uart_Get(CONSOLE_UART,buffer,1);// USB_RxRead( buffer, 8 );
	
	if( len == 0 ) return;

	if( buffer[0] == 'd' ){
		debug_en = debug_en ? 0:1;
	}else if( buffer[0] == '1' ){
		uart_pressure_dev = &Uart1;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart1\n");
	}else if( buffer[0] == '2' ){
		uart_pressure_dev = &Uart2;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart2\n");
	}else if( buffer[0] == '3' ){
		uart_pressure_dev = &Uart3;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart3\n");
	}else if( buffer[0] == '4' ){
		uart_pressure_dev =  &Uart4;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart4\n");
	}else if( buffer[0] == '0' ){
		uart_pressure_dev = NULL;
		uart_pressure_test_en = 0;
		_LOGW("Uart Test STOP\n");
	}
}


volatile int relayTestIndex = 0;
volatile int relayTestCounter = 0;
void relay_test_even()
{
	static int on_off = 0;
	
	if( relayTestIndex == 0 ) return;
	
	systick_delay_ms(500);
	if( on_off ){
		relay_update_status(relayTestIndex);
		on_off = 0;
		relayTestCounter++;
	}else{
		relay_update_status(0);
		on_off = 1;
	}
}


void PC_msg_handler(PMSG_msg_t msg)
{
	int value,res;
	
	switch( msg.tag )
	{
		case PC_TAG_CMD_SWITCH:
			if( msg.data_len == 1 ){
				relay_update_status( msg.data[0] );
				PC_LOGI("PC_TAG_CMD_SWITCH: status = %02x", relay_status);
			}else{
				PC_LOGE("PC_TAG_CMD_SWITCH: unknow data");
			}
		break;
			
		case PC_TAG_CMD_UART_TEST:
			if( msg.data_len != 1 ){
				if( msg.data[0] == 0 ){
					uart_pressure_dev = NULL;
					uart_pressure_test_en = 0;
					_LOGW("Uart Test STOP\n");
				}else if( msg.data[0] >= 1 && msg.data[0] <= 5){
					uart_pressure_test_en = 1;
					uart_pressure_round = 0;
					uart_pressure_dev = UartList[msg.data[0]-1];
					PC_LOGE("PC_TAG_CMD_UART_TEST: Uart%d start test\n",msg.data[0]-1);
				}else{
					PC_LOGE("PC_TAG_CMD_UART_TEST: data out of range");
				}
			}else{
				PC_LOGE("PC_TAG_CMD_UART_TEST: unknow data");
			}
		break;
			
		case PC_TAG_CMD_CAPTURE_EN:
		case PC_TAG_CMD_LED_SELECT:
		case PC_TAG_CMD_CAPTURE_INTERVAL:
		case PC_TAG_CMD_TEST:
		case PC_TAG_CMD_SWITCHES_TESTMODE:
		case PC_TAG_CMD_SWITCHES_CHANNEL:
			
			if( 0 == PMSG_send_msg_no_Tag( &LED_pmsg , msg.alldata, msg.alldata_len) ){
				PC_LOGE("PC_msg_handler: Forward bytes to LED Failed");
			}
		break;
			
		case PMSG_TAG_IAP_START_ID:
			if( msg.data_len == 1 ){
				iap_jump();
			}else{
				PC_LOGE("PMSG_TAG_IAP_START_ID: data error");
			}
		break;
			
		case PC_TAG_CMD_AMETER_READ:
			if( msg.data_len == 1 ){
				if( 0 == Ameter_start( msg.data[0] ) ){
					PC_LOGE("PC_TAG_CMD_AMETER_READ: start meter failed");
				}
			}else{
				PC_LOGE("PC_TAG_CMD_AMETER_READ: data error");
			}
		break;
			
		case PC_TAG_CMD_VMETER_READ:
			if( msg.data_len == 1 ){
				#if USING_VICTOR8165_AS_VMETER
				if( msg.data[0] == 0 ){
					victor8165_stop();
				}else{
					victor8165_start();
				}
				#endif
				#if USING_TONGHUI_TH963_VMETER
				if( 0 == TH963_start( &Vmeter_th963, msg.data[0] ) ){
					PC_LOGE("PC_TAG_CMD_VMETER_READ: start meter failed");
				}
				#endif
			}else{
				PC_LOGE("PC_TAG_CMD_VMETER_READ: data error");
			}
		break;
			
		case PC_TAG_FORWARD_LEDBOARD:
			if( msg.data_len >= 1 ){
				if( 0 == PMSG_send_msg_no_Tag( &LED_pmsg , msg.data, msg.data_len) ){
					PC_LOGE("PC_TAG_FORWARD_LEDBOARD: send Failed");
				}
			}else{
				PC_LOGE("PC_TAG_FORWARD_LEDBOARD: data error");
			}
		break;
			
		case 0xff:
			PC_LOGI("Last Relay Test: 0x%02x, On-Off count:%d",relayTestIndex, relayTestCounter);
			relayTestIndex = msg.data[0];
			relayTestCounter = 0;
			PC_LOGI("Start Relay Test: 0x%02x",relayTestIndex);
		break;
			
		default:
			if( (msg.tag & 0xf0) != PMSG_TAG_FORWARD )
			{
				PC_LOGE("PC_PMSG:  unknow data(0x%02x)",msg.tag);
				break;
			}
			
			if( (msg.tag&0x0f) == 0x2 ){
				Uart_Put(&Uart2, msg.data,msg.data_len);
			}else if( (msg.tag&0xf) == 0x3 ){
				Uart_Put(&Uart3, msg.data,msg.data_len);
			}else if( (msg.tag&0xf) == 0x4 ){
				Uart_Put(&Uart4, msg.data,msg.data_len);
			}else if( (msg.tag&0xf) == 0x5 ){
				Uart_Put(&Uart5, msg.data,msg.data_len);
			}else{
				PC_LOGE("PMSG_FORWARD:  unknow way (0x%02x)",msg.tag);
			}
			break;
	}
	
}


//just forward to PC 
void LED_msg_handler(PMSG_msg_t msg)
{
	if( 0 == PMSG_send_msg_no_Tag( &PC_pmsg , msg.alldata, msg.alldata_len) ){
		PC_LOGE("LED_msg_handler: Forward to PC error");
	}
}








#if BOARD_IAP 
void app_init()
{
	relay_init();
	Uart_USB_SWJ_init();
#if IAP_APP_PORT_UART
	iap_app_init(PC_UART,PORT_UART_TYPE );
#endif
}
void app_event()
{
	iap_app_event();
}
#else



void app_init()
{
	relay_init();
	Uart_USB_SWJ_init();
	PMSG_init_uart( &PC_pmsg, PC_UART, PC_msg_handler );
	PMSG_init_uart_irq( &LED_pmsg, LED_UART, LED_msg_handler );
	switch_init();
	Ameter_init();
	
#if USING_VICTOR8165_AS_VMETER
	victor8165_init( VMETER_UART );
#endif
#if USING_TONGHUI_TH963_VMETER
	TH963_init( &Vmeter_th963 , VMETER_UART );
#endif
	

	if( SystemCoreClock != 72000000 ){
		_LOGE("CLK init error");
		systick_delay_ms(1000);
		while(1);
	}
	
#if BOARD_HAS_IAP
	#if IAP_PORT_USB 
	iap_init_in_usb();
	#endif
	#if IAP_PORT_CAN1
	iap_init_in_can1();
	#endif
	#if  IAP_PORT_UART
	iap_init_in_uart( IAP_UART );
	#endif
#endif
	
	PC_LOGI("Init OK");
}


void app_event()
{

	switch_even();
	
#if USING_CMD_EVEN
	cmd_even();
#endif
	
	relay_test_even();
	
	if( uart_pressure_test_en == 1 )
	{ 
		uart_pressure_test_loop();
	}else{
		PMSG_even( &PC_pmsg );
		//PMSG_even( &LED_pmsg );
	}
	
#if USING_VICTOR8165_AS_VMETER
	victor8165_even();
#endif
#if USING_TONGHUI_TH963_VMETER
	TH963_even(&Vmeter_th963);
#endif
	
}


#endif // BORAD_IAP






#endif //BOARD_CSWL_LED_MONITOR
